export const PREGNANCY_HEADING_DATA = {
  title: 'اپلیکیشن بارداری هفته به هفته ایمپو',
  description:
    'با اپلیکیشن بارداری ایمپو، وضعیت جنین، مراقبت‌ها و آزمایش‌ها رو به صورت هفته به هفته دنبال کن و با توصیه‌های تخصصی،رژیم غذایی و پزشک آنلاین، بارداری رو با اطمینان و آرامش سپری کن.',
  gradientFrom: '#FFF4F3',
  gradientTo: '#FDCFCA',
  image: '/assets/images/headingPregnancy.webp',
};

export const PREGNACNY_ACHIEVEMENTS_LIST = [
  { title: '20000000 +', subTitle: 'چرخه ثبت‌شده' },
  { title: '3000000 +', subTitle: 'نصب ایمپو' },
  { title: '1000 +', subTitle: 'مقاله منتشر‌شده' },
];

export const PREGNACNY_COMMENTS_LIST = [
  {
    text: 'خیلی اپ عالیی هستش حس ارامش و اطلاعاتی که راجب چرخه پریودی میده، خیلی قشنگه',
    userName: '@sahar',
    userImage: '/assets/images/comments/1.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'واقعا برنامه ی بی نظیری هست و خیلی منظم و دقیقه ممنونم از طراح این برنامه و همچنین دکترهای عزیز این برنامه به خاطر صبوریشون و همچنین توضیحات کامل تو پاسخگویی به سوالات ما مراجعه کننده ها😍😍😍😍',
    userName: '@zakie saberi',
    userImage: '/assets/images/comments/2.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'ممنونم ازبرنامه خیلی خوبتون همیشه احساس میکنم یکی کنارم هست که هوامو داره توشرایط بحرانی قبل پریود تشکربابت همدلی وراهنماییتون',
    userName: '@najmeh sadeghi',
    userImage: '/assets/images/comments/3.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: 'بنظر من ایمپو بسیار برنامه‌ی کاربردی هستش و خیلی در بهبود روابط موثرومفید هست.من که خیلی راضیم',
    userName: '@zeinab Taksavar',
    userImage: '/assets/images/comments/4.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: ' ‏✓ محاسبه دقیق ‏✓ پیام‌های مرتبط با وضعیت‏✓ گزارش از پریودها‏✓ مقاله‌های به روز‏✓ اشتراک گذاری پریود و حال روز با پارتنر',
    userName: '@mozhgan',
    userImage: '/assets/images/comments/5.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'این اپلیکیشن واقعا قلب منو داره، آپدیت جدید خیلی خوب بود خیلی خوشگل شده 😍🥰 علاوه بر اون یه سری جزئیات ریز و جالبی به اپ اضافه شده. در کل این اپ به شما تجربه مراقبت از دخترونگی‌هاتونو با خیال راحت میده ❤️',
    userName: 'مژگان',
    userImage: '/assets/images/comments/6.webp',
    downloadPortIcon: '/assets/icons/instagram.svg',
  },
  {
    text: 'خیلی برنامه خوبیه ❤️بنظر من ارزش داره که آدم مراقب سلامتیش باشه. من که راضیم ❤️',
    userName: 'سحر',
    userImage: '/assets/images/comments/7.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: 'عالیه 👌 حتی برای پریود نامنظم هم برنامه داره 😍 بنظرم لازمه ایمپو آقایان رو هم پسرا نصب کنن و به همدلشون وصل بشن تا تو روزای پریودی سر به سر پارتنرشون نذارن 😁',
    userName: 'عاطفه',
    userImage: '/assets/images/comments/8.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
];

export const PREGNACNY_FEATURES_INTRODUCTION_LIST = [
  {
    image: '/assets/images/featuresIntroduction/pregnancy/0.webp',
    title: 'اطلاعات هفته به هفته جنین',
    description:
      'ایمپو اطلاعات هفته به هفته رشد جنینت رو نشون می‌ده؛ از تغییرات قد و وزن گرفته تا مراحل مهم رشد، هر چیزی که به‌عنوان مادر برات جذاب و مهمه.',
  },
  {
    image: '/assets/images/featuresIntroduction/pregnancy/1.webp',
    title: 'یادآوری و اطلاع‌رسانی تاریخ‌های مهم',
    description:
      'با اپلیکیشن بارداری ایمپوهمیشه آماده‌ای، تمام چیزهایی که باید به‌عنوان مادر بدونی‌، مثل تاریخ‌های مهم سونوگرافی یا ویزیت‌های دوره‌ای پزشک رو هم بهت یادآوری می‌کنیم تا از برنامه عقب نمونی!',
  },
  {
    image: '/assets/images/featuresIntroduction/pregnancy/2.webp',
    title: 'پیگیری و یادآوری مراقبت‌های بارداری',
    description:
      'در برنامه بارداری هفته به هفته ایمپو، همه ویزیت‌های دوره‌ای، آزمایش‌های مهم و تاریخ‌های سونوگرافی دوران بارداریت رو بهت نمایش می‌دیم و یادت میاریم تا بتونی با خیال راحت از سلامت خودت و جنینت مراقبت کنی!',
  },
  {
    image: '/assets/images/featuresIntroduction/pregnancy/3.webp',
    title: 'ثبت فشار خون و قند خون',
    description:
      'در ایمپو، می‌تونی فشار خون و قند خونت رو ثبت کنی و روند تغییراتش رو پیگیری کنی تا همیشه از وضعیت سلامتت با خبر باشی و بارداری سالم‌تری داشته باشی!',
  },
  {
    image: '/assets/images/featuresIntroduction/pregnancy/4.webp',
    title: 'رژیم‌های غذایی',
    description:
      'در برنامه بارداری هفته به هفته ایمپو، به رژیم غذایی مخصوص خودت دسترسی داری تا با برنامۀ تغذیه مناسب، سلامت خودت و جنینت رو تضمین کنی!',
  },
];
