export const INTENTION_HEADING_DATA = {
  title: 'کشف بهترین زمان اقدام به بارداری با ایمپو',
  description: 'ایمپو کمکت می‌کنه تا چرخه باروری بدنت رو بشناسی و بهترین زمان برای اقدام به بارداری رو پیدا کنی.',
  gradientFrom: '#F2F7F8',
  gradientTo: '#C6DFE2',
  image: '/assets/images/headingIntention.webp',
};

export const INTENTION_ACHIEVEMENTS_LIST = [
  { title: '20000000 +', subTitle: 'چرخه ثبت شده' },
  { title: '3000000 +', subTitle: 'نصب ایمپو' },
  { title: '1000 +', subTitle: 'مقاله منتشر شده' },
];

export const INTENTION_COMMENTS_LIST = [
  {
    text: 'خیلی اپ عالیی هستش حس ارامش و اطلاعاتی که راجب چرخه پریودی میده، خیلی قشنگه',
    userName: '@sahar',
    userImage: '/assets/images/comments/1.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'واقعا برنامه ی بی نظیری هست و خیلی منظم و دقیقه ممنونم از طراح این برنامه و همچنین دکترهای عزیز این برنامه به خاطر صبوریشون و همچنین توضیحات کامل تو پاسخگویی به سوالات ما مراجعه کننده ها😍😍😍😍',
    userName: '@zakie saberi',
    userImage: '/assets/images/comments/2.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'ممنونم ازبرنامه خیلی خوبتون همیشه احساس میکنم یکی کنارم هست که هوامو داره توشرایط بحرانی قبل پریود تشکربابت همدلی وراهنماییتون',
    userName: '@najmeh sadeghi',
    userImage: '/assets/images/comments/3.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: 'بنظر من ایمپو بسیار برنامه‌ی کاربردی هستش و خیلی در بهبود روابط موثرومفید هست.من که خیلی راضیم',
    userName: '@zeinab Taksavar',
    userImage: '/assets/images/comments/4.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: ' ‏✓ محاسبه دقیق ‏✓ پیام‌های مرتبط با وضعیت‏✓ گزارش از پریودها‏✓ مقاله‌های به روز‏✓ اشتراک گذاری پریود و حال روز با پارتنر',
    userName: '@mozhgan',
    userImage: '/assets/images/comments/5.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'این اپلیکیشن واقعا قلب منو داره، آپدیت جدید خیلی خوب بود خیلی خوشگل شده 😍🥰 علاوه بر اون یه سری جزئیات ریز و جالبی به اپ اضافه شده. در کل این اپ به شما تجربه مراقبت از دخترونگی‌هاتونو با خیال راحت میده ❤️',
    userName: 'مژگان',
    userImage: '/assets/images/comments/6.webp',
    downloadPortIcon: '/assets/icons/instagram.svg',
  },
  {
    text: 'خیلی برنامه خوبیه ❤️بنظر من ارزش داره که آدم مراقب سلامتیش باشه. من که راضیم ❤️',
    userName: 'سحر',
    userImage: '/assets/images/comments/7.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: 'عالیه 👌 حتی برای پریود نامنظم هم برنامه داره 😍 بنظرم لازمه ایمپو آقایان رو هم پسرا نصب کنن و به همدلشون وصل بشن تا تو روزای پریودی سر به سر پارتنرشون نذارن 😁',
    userName: 'عاطفه',
    userImage: '/assets/images/comments/8.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
];

export const INTENTION_FEATURES_INTRODUCTION_LIST = [
  {
    image: '/assets/images/featuresIntroduction/intention/0.webp',
    title: 'پیش‌بینی زمان باروری و تخمک‌گذاری',
    description:
      'تو ایمپو، تاریخ‌های مهم چرخه قاعدگیت رو برات پیش‌بینی می‌کنیم؛ مثل دوره باروری، روز تخمک‌گذاری، شروع پریود و هر موردی که نیاز به برنامه ریزی داره.',
  },
  {
    image: '/assets/images/featuresIntroduction/intention/1.webp',
    title: 'یادآوری و اطلاع‌رسانی تاریخ‌های مهم',
    description:
      'تو ایمپو، تاریخ‌های مهم چرخه قاعدگیت رو یادت میاریم و بهت نوتیف می‌دیم؛ مثل شروع پریود، روز تخمک‌گذاری و دوره باروری، تا همیشه به موقع در جریان باشی!',
  },
  {
    image: '/assets/images/featuresIntroduction/intention/2.webp',
    title: 'محاسبه احتمال بارداری',
    description:
      'تو ایمپو، احتمال بارداری رو برات محاسبه می‌کنیم تا بدونی تو هر روز از چرخه قاعدگیت و زمان رابطه جنسی، چقدر احتمال بارداری داری و بتونی با خیال راحت‌تر برنامه‌ریزی کنی!',
  },
  {
    image: '/assets/images/featuresIntroduction/intention/3.webp',
    title: 'ثبت و تفسیر بیبی چک',
    description:
      'تو ایمپو می‌تونی نتایج بیبی چک‌هات رو ثبت کنی و تفسیرش رو به ما بسپری. بهت کمک می‌کنیم تا نتیجه رو دقیق‌تر بفهمی و قدم بعدی رو با اطمینان برداری!',
  },
];
