import HeaderFooterContainer from '@components/HeaderFooterContainer';
import CustomTypography from '@components/ui/CustomTypography';

const TermsContainer = () => {
  return (
    <HeaderFooterContainer>
      <div className="bg-[url(/assets/images/termsHero.webp)] w-full h-full py-24 sm:pt-44 sm:pb-40 px-4 bg-no-repeat mb-8">
        <CustomTypography tagType="h3" fontSize="Title_Large" className="text-center pt-4 sm:!text-4xl">
          قوانین و مقررات ایمپو
        </CustomTypography>
      </div>
      <div className="md:px-[156px] px-[30px]">
        <CustomTypography
          tagType="span"
          fontSize="Headline_Small"
          className="mb-4 inline-block"
          color="Neutral_OnBackground"
        >
          قوانین
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10 mt-4 inline-block md:!text-[18px]">
          ایمپو؛ ابزاری در جهت افزایش سطح دسترسی و ارتقا کیفیت خدمات بهداشت و سلامت در بستر نرم افزار و اینترنت است و
          <strong> همواره در تلاش است با پوشش‌دهی تخصص‌های مرتبط در جهت رفاه حال کاربران گام بردارد. </strong>ما متعهد
          هستیم که به شما برای قوی‌تر و سالم‌تر شدن زندگی کمک کنیم .
        </CustomTypography>

        <CustomTypography className=" md:!text-[16px]" tagType="p">
          در این متن به‌منظور استفاده بهینه از خدمات و برنامه‌های کاربردی، حقوق و مسئولیت کاربر، پزشک, مشاور و پلتفرم
          ایمپو به دقت بیان شده است. بر این اساس امیدواریم تا کاربر از خدمات فراهم شده بهترین استفاده و بهره را ببرد.
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10 inline-block md:!text-[18px]">
          <strong>کلینیک و مشاوره سلامت آنلاین ایمپو </strong>علاوه بر سهولت دسترسی تمامی ایرانیان و همچنین کاربرانی که
          امکان مراجعه حضوری ندارند به‌منظور
          <strong>برقراری ارتباط بین بیمار و پزشک/مشاور به جهت دریافت درمان/مشاوره غیر‌حضوری </strong>به‌وجود آمده است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  inline-block md:!text-[18px]">
          قوانین، مقررات و قرارداد زیر با هدف تعیین جزییات استفاده از خدمات اپلیکیشن ایمپو تنظیم شده است:
        </CustomTypography>

        <CustomTypography tagType="span" fontSize="Headline_Small" className="mb-4 block" color="Neutral_OnBackground">
          تعاریف و اصطلاحات:
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  inline-block md:!text-[18px]">
          اصطلاحاتی که در این دستورالعمل و قوانین به‌کار رفته، دارای معانی مشروح زیر است:
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong>شرکت: </strong>شرکت توسعه فناوری اطلاعات کارآفرین کارکیا شماره ثبت 71838 که نسبت به ارائه خدمات
          اپلیکیشن ایمپو اقدام می‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong>اپلیکیشن: </strong>نرم‌افزار متعلق به شرکت که به‌منظور استفاده از خدمات ایمپو، حق استفاده موقت از آن
          برابر شرایط مندرج در سند حاضر به کاربران شرکت اعطا می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong>کاربر: </strong> شخصی حقیقی یا حقوقی اعم از خدمت‌گیرنده و خدمت‌دهنده است که با ثبت اطلاعات کاربری خود
          در فرم ثبت نام بر اساس شرایط و قوانین حاضر از طریق اینترنت به اپلیکیشن یا سایت متصل و از هرگونه خدمات ایمپو
          بهره‌مند می‌شود.
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong> کد تخفیف: </strong> کد صادر شده توسط ایمپو که کاربر خدمت‌گیرنده با وارد کردن آن در اپلیکیشن از پرداخت
          کل یا قسمتی از هزینه خدمات معاف می‌شود.
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong> اطلاعات محرمانه: </strong> اطلاعاتی که توسط کاربر در اختیار ایمپو و کاربر خدمت‌دهنده قرار می‌گیرد.
          اعم از اطلاعاتی که به‌صورت مستقیم از سوی کاربر در ایمپو ثبت و همچنین اطلاعاتی که به‌صورت خودکار و در نتیجه
          بهره‌برداری از خدمات ایمپو تولید می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong> حساب کاربری: </strong> حسابی که شخص برای استفاده از خدمات در اپلیکیشن یا سایت ساخته‌ است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong>کلینیک ایمپو: </strong> خدمات نرم‌افزاری شرکت جهت برقراری ارتباط بین کاربران خدمت‌دهنده و خدمت‌گیرنده
          برای ارائه خدمات سلامت محور اعم از مشاوره، ویزیت پزشک و نظایر آن از طرف کاربر خدمت‌دهنده به کاربر خدمت‌گیرنده.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong> کاربر خدمت‌دهنده: </strong>شخص حقیقی یا حقوقی دارای صلاحیتی است که در اپلیکیشن ایمپو برای ارائه خدمات
          ثبت‌‌نام کرده ‌است و بر‌اساس قوانین کشور جمهوری اسلامی ایران مجوز یا پروانه معتبر مورد نیاز برای ارائه خدمت
          مورد نظر در حوزه تخصص ثبت شده در سامانه را دارد و ممنوعیت یا منعی از طرف مراجع ذی‌صلاح برای فعالیت ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong> مشاوره یا توصیه: </strong> هرگونه گفتار و نوشتاری که در پاسخ به درخواست کاربر خدمت‌گیرنده از سوی
          کاربر خدمت‌دهنده (از طریق بستر ایمپو) به وی ارائه می‌شود.
        </CustomTypography>

        <CustomTypography tagType="span" fontSize="Headline_Small" className="mb-4 block" color="Neutral_OnBackground">
          دسته‌بندی قوانین و مقررات:
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> قوانین عمومی:</u>
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ورود کاربر و بهره‌گیری از پروفایل شخصی در نرم‌افزارهای کاربردی، تلفن همراه و سایر خدمات ارائه شده توسط مجموعه
          به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‌‏ها و خدمات ایمپو است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کلیه اصول و رویه‏‌های ایمپو منطبق با قوانین جمهوری اسلامی ایران بوده و متعاقبا کاربر نیز موظف به رعایت قوانین
          مرتبط با کاربر است. در صورتی‌که در آینده در قوانین مندرج و رویه‏‌ها تغییراتی ایجاد شود، حداقل ۲ ماه قبل در
          همین صفحه منتشر و به‌روزرسانی خواهد شد. کاربر توافق می‏‌کند استفاده مستمر به معنی پذیرش هرگونه تغییر بوده و در
          صورت عدم آگاهی از این تغییرات، عذر وی به هیچ وجه پذیرفته نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایمپو سامانه‌ای متشکل از نرم‌افزار موبایل، وب سایت , شبکه‌های اجتماعی در اکوسیستم حوزه بهداشت و سلامت است که
          جهت افزایش کیفیت و تسهیل دسترسی تمامی ایرانیان به خدمات بهداشت و سلامت ایجاد شده است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          این سامانه برای استفاده و ارائه خدمات در موارد اورژانس پزشکی، اورژانس اجتماعی و هر مورد اورژانسی دیگر یا
          مواردی که در آن حضور فیزیکی متخصص و یا معاینه بالینی نیاز باشد، ایجاد نشده و در این موارد خدماتی ارائه
          نمی‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> قوانین کاربر: </u>
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          با ثبت‌نام در ایمپو و همچنین با هر بار استفاده از هرگونه خدمات آن، کاربر می‌پذیرد که شرایط و قوانین حاضر را
          به‌طور کامل و دقیق مطالعه کرده و شرایط و ضوابط آن را پذیرفته‌ است. این شرایط و قوانین ممکن است در طول زمان
          تغییر کند. استفاده کاربر از اپلیکیشن، پس از هر بار تغییر در شرایط و قوانین، به معنی پذیرش تغییرات مذکور است.
          این قوانین برای مطالعه کاربر در سایت و اپلیکیشن ایمپو در دسترس است و ادعای عدم اطلاع و عدم مطالعه آن به هیچ
          وجه قابل پذیرش نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر (اعم از خدمت‌دهنده و خدمت‌گیرنده ) متعهد است که در زمان استفاده از اپلیکیشن ایمپو کلیه موازین قانونی و
          اخلاقی را رعایت کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          اشخاصی که واجد اهلیت قانونی هستند، می‌توانند اقدام به ساخت حساب کاربری کنند. کاربر با ایجاد حساب کاربری صحت
          اطلاعات ابراز شده را تایید می‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر صرفا با ایمیل شخصی یا شماره تلفن همراه شخصی خود مجاز به ثبت‌نام است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد کلیه اطلاعات درخواستی را مطابق با واقعیت و به‌طور صحیح در اپلیکیشن وارد کند. شخص کاربر، مسئول
          عدم صحت و به‌ روز نبودن اطلاعات است. در صورت اثبات خلاف این موضوع، شرکت هیچ مسئولیتی در برابر خسارات و مشکلات
          ناشی از عدم اعتبار اطلاعات اعلام شده، برعهده ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت تامین زیر ساخت‌های لازم و همچنین پرداخت هزینه‌های مربوط به آن‌ها برای استفاده از خدمات ایمپو، به عهده
          کاربر است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت همه فعالیت‌هایی که از طریق حساب کاربری در اپلیکیشن انجام می‌شود، به عهده کاربر است. بنابراین مسئولیت
          اشخاص ثالث یا افرادی غیر از کاربر که با آن حساب، از خدمات اپلیکیشن استفاده می‌کنند، تماماً متوجه کاربر صاحب
          حساب است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر باید این نکته را مدنظر داشته باشد کلیه سرویس‌ها و خدمات ایمپو شامل خدمات اورژانس پزشکی یا اجتماعی نشده و
          در این موارد خدماتی ارائه نمی‌کند. (لازم به ذکر است در چنین مواردی کاربر باید با اورژانس شهر خود یا هر مرجع در
          نظر گرفته شده برای رسیدگی به آن مورد اورژانسی تماس بگیرد.)
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایمپو دارای سرویس‌‏هایی با قابلیت مشارکت عمومی موسوم به سرویس‌‏های جمعی، همچون اشتراک تجربه، تالار گفتگو، نقد،
          گروه‌‏های خبری و سرویس‏‌های دیگر برای تسهیل ارتباط(چه در مقیاس عمومی مثل تالار گفتگو و چه در مقیاس خصوصی )
          است. کاربر می‌پذیرد از این سرویس‏‌های جمعی فقط برای ثبت، ارسال و دریافت پیام‏‌هایی مناسب و مرتبط با آن سرویس
          خاص استفاده کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت حفظ امنیت اطلاعات حساب کاربری شامل نام کاربری و رمز عبور به عهده کاربر است. در صورت مفقود شدن یا به
          سرقت رفتن اطلاعات حساب کاربری و گوشی موبایل، کاربر موظف است بلافاصله و بدون فوت وقت موضوع را به اطلاع شرکت
          برساند. بدیهی است مسئولیت همه فعالیت‌هایی که از طریق حساب کاربری مذکور و موبایل کاربر انجام خواهد شد، به عهده
          کاربر خواهد بود.
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          از آنجایی‌که حساب کاربری صرفاً متعلق به شخص کاربر است از این رو نباید اطلاعاتش را در اختیار شخص دیگری قرار
          دهد. همچنین کاربر نباید به سایر اشخاص حقیقی و حقوقی اجازه استفاده از حساب کاربری خود را بدهد.
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر متعهد می‌شود هیچ‌گاه از خدمات ایمپو به صورتی استفاده نکند که به ایمپو، شرکای آن و اشخاص ثالث صدمه‌ای
          (‌اعم از مادی و معنوی) وارد شود. در صورتی‌که کاربر از امکانات فراهم شده در خدمات ایمپو در جهت آسیب مادی یا
          معنوی به منافع شرکت و اشخاص ثالث سوء استفاده کند، شرکت ضمن داشتن حق قطع خدمات و غیرفعال کردن حساب کاربری وی،
          مجاز خواهد بود از طريق مراجع ذی‌صلاح، نسبت به پیگیری قانونی از جمله مطالبه خسارات وارد شده اقدام کند.
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد هنگام استفاده از اپلیکیشن ایمپو آن را وسیله‌ای برای تبلیغات و بازاریابی کالا و خدمات شخصی خود
          قرار ندهد و از هرگونه معرفی و عرضه محصولات و خدمات شخصی یا متعلق به دیگران خودداری کند. در صورتی‌که شرکت به هر
          نحوی نقض این بند را احراز کند، می‌تواند در خصوص ادامه فعالیت کاربر تصمیم مقتضی را اتخاذ کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          آدرس ایمیل و شماره همراه که کاربر در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید
          کاربر است و تمام مکاتبات و پاسخ‌ها از طریق آنها صورت می‌گیرد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت همه اقدامات، افعال و ترک فعل کاربران که ناشی از عدم رعایت مقررات و دستورالعمل‌های سازمان غذا و دارو و
          قوانین و مقررات موضوعه جمهوری اسلامی ایران از جمله قانون مجازات اسلامی (ارتکاب جرم در هنگام استفاده از خدمات
          اپلیکیشن ایمپو) و قوانین مدنی باشد، به عهده شخص متخلف است و شرکت هیچ مسئولیتی در قبال اعمال، افعال و ترک فعل
          فوق ندارد. شرکت می‌تواند ضمن غیر فعال کردن حساب کاربری متخلف، از طریق مراجع ذی‌صلاح، اقدامات قانونی را علیه
          نامبرده نسبت به احقاق حقوق قانونی خود به عمل آورد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          هرگونه اقدام از سوی کاربر که به ورود خسارت به شهرت، اعتبار و دارایی‌های شرکت منجر شود، تخلف تلقی خواهد شد.
          شرکت این حق را برای خود محفوظ می‌داند که حساب کاربر متخلف را مسدود و در صورت نیاز اقدامات قانونی لازم را علیه
          متخلف به‌عمل آورد و خسارت و حقوق قانونی خود را مطالبه کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربران باید توجه داشته باشند هرگونه توصیه و مشاوره ارائه شده مختص شخصی است که درخواست داشته است. با توجه به
          تفاوت شرایط هر فرد نسبت به فرد دیگر، کاربر باید از عمل به مشاوره و توصیه ارائه شده به شخص دیگر خودداری کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد اعتباری که در حساب کاربری خود دارد مستقل از روش کسب قانونی آن (اگر در نتیجه افزایش اعتبار از
          طریق درگاه بانک یا وارد کردن کدهای تخفیفی که شرکت در اختیار آن‌ها قرار داده یا هر روش دیگری باشد) فقط برای
          بهره‌مندی از خدمات ایمپو قابل استفاده است و امکان دریافت این وجه به‌صورت نقد وجود ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد کدهایی که جهت افزایش اعتبار یا کاهش هزینه ارائه خدمات به وی داده می‌شود، ممکن است منقضی شوند.
          از آنجایی که شرکت برای ارائه این کدها هزینه‌ای از کاربر دریافت نمی‌کند، این حق برای شرکت محفوظ است که مبلغ یا
          درصد تاثیر این کدها را حتی پس از انتشار، بر اساس شرایط کد اختصاص داده شده، تغییر دهد یا در صورت لزوم، آن‌ها را
          باطل کند. همچنین در صورتی‌که شرکت تشخیص دهد، اعمال کد به علت خطای فنی یا تخلف صورت گرفته و یا غیرقانونی بوده
          است، می‌تواند این کدها یا اعتباری که در نتیجه استفاده از آن به حساب کاربر افزوده شده را باطل یا حذف کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          نکته: در صورت حذف حساب کاربری دسترسی به سرویس‌های خریداری شده نیز از بین خواهد رفت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر توجه داشته باشد که 90001349 شماره‌ای است که ایمپو از طریق آن برای کاربر خود پیامک (اس ام اس) ارسال
          می‌کند. بنابراین ارسال هرگونه پیامک تحت عنوان ایمپو، با شماره دیگر تخلف و سوء استفاده از نام ایمپو است. در
          صورت دریافت چنین پیامکی، الزامی است آن را به 91014180-051 اطلاع دهید.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> قوانین و مقررات کاربران درکلینیک سلامت </u>
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایجاد تجربه‌ا‌ی پایدار و برخوردار از بالاترین سطح استاندارد برای کاربر از وظایف اصلی ایمپو است. سرویس کلینیک
          یک بستر امن برای ایجاد ارتباط بین کاربر و پزشک/ مشاور است. در این سرویس با توجه به نوع پلن انتخاب شده می‌توان
          به ارائه و دریافت خدمات پزشکی و مشاوره پرداخت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در این راستا قوانین و مقرراتی تدوین شده و همکاری بین پزشکان با ایمپو منوط به رعایت قوانین و مقررات زیر است:
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت رعایت همه قوانین و مقررات حوزه سلامت اعم از سیاست‌های ابلاغی، قوانین مصوب مجلس شورای اسلامی،
          آیین‌نامه‌های مصوب هیئت وزیران و سایر مقررات حوزه سلامت، بهداشت و درمان که توسط نهادهای ذی‌ربط به تصویب
          رسیده‌اند، بر عهده کاربران است و شرکت در این خصوص مسئولیتی نخواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربران متعهد می‌شوند در صورت مواجهه با نقض هر کدام از تعهدات حین ارائه خدمت یا نقض قوانین موضوعه جمهوری
          اسلامی ایران از جمله قانون مجازات اسلامی (ارتکاب جرم) و قوانین مدنی، بدون مداخله مستقیم، از انجام هر اقدامی بر
          اساس صلاح‌دید شخصی پرهیز کند. کاربر خدمت‌دهنده در صورت نیاز می‌تواند ارائه خدمت خود را به‌طور موقت متوقف و
          موضوع را از طریق شماره 91014180-051 با پشتیبانی شرکت در میان بگذارد، کاربر خدمت‌گیرنده نیز می‌تواند تا برقراری
          تماس با پشتیبانی از کاربر خدمت‌دهنده درخواست توقف خدمت مورد نظر را داشته باشد. در نهایت پشتیبانی شرکت نسبت به
          ادامه یا منتفی شدن خدمت موردنظر، بر مبنای وضعیت موجود تصمیم مقتضی را اخذ می‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در حال حاضر در کلینیک سلامت، خدمات مشاوره آنلاین تحت پوشش بیمه‌های پایه و تکمیلی نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          صدور مرخصی استعلاجی مستلزم حضور فیزیکی پزشک و متقاضی است، بنابراین به دلیل امکان‌پذیر نبودن اعتبارسنجی در بستر
          سکو، صدور مرخصی استعلاجی میسر نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در هر مشاوره، گفتگوی بین کاربر و پزشک/مشاور حول یک موضوع مشخص خواهد بود. کاربر اگر تمایل به مطرح کردن موضوعات
          متنوع دارد لازم است در مشاوره‌های جدید به این موضوعات بپردازد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          هر گونه مبلغ پرداختی از سوی بیمار، برای یک درخواست است. در صورتی‌که بیمار به ویزیت با پزشک / مشاور دیگری نیاز
          داشته باشد باید پرداختی برای پزشک/ مشاور دیگر دوباره انجام شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت صحت و سقم اظهارات بیمار به عهده خودش بوده و استفاده از خدمات پزشکی/مشاوره ایمپو به معنی تحصیل برائت از
          تقصیر و برائت از ضمان پزشک/مشاور معالج توسط بیمار است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر باید توجه داشته باشد، هرگونه توصیه و مشاوره ارائه شده توسط پزشک/مشاور، فقط مختص شخصی است که درخواست
          مشاوره داشته و با توجه به تفاوت شرایط هر شخص نسبت به شخص دیگر، کاربر باید از انتقال مشاوره یا توصیه ارائه شده
          به شخص دیگر خودداری نماید.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌تواند در تمامی سرویس‌های کلینیک، با ارسال متن، تصاویر، مدارک پزشکی و صوت (از سمت کاربر خدمات دهنده)
          با پزشک و مشاور گفتگو کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در صورت عدم پاسخگویی پزشک/مشاور در زمان مقرر هر پلن، 100% وجه به اعتبار کاربر افزوده شده یا سوالش به پزشک /
          مشاور دیگر ارجاع داده می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد هزینه ارائه خدمات از طرف شرکت مشخص می‌شود و پس از استفاده از آن نمی‌‌تواند نسبت به هزینه اعلام
          شده اعتراضی داشته باشد. بدیهی است، از آنجایی که کاربر مجاز است هزینه اعلان شده از سوی شرکت را نپذیرد، بنابراین
          در صورت قبول آن، متعهد به پرداخت هزینه می‌باشد. به همین منظور کاربر با قبول این شرایط و قوانین، به شرکت اختیار
          می‌دهد که از محل اعتبار کاربری خود، مبالغ مورد مطالبه را دریافت و وصول کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پرداخت هزینه خدمت ارائه شده و سایر هزینه‌های اعلام شده توسط ایمپو فقط از طریق روش‌هایی که توسط شرکت مشخص
          می‌شود امکان پذیر است. هرگونه روش دیگری نظیر کارت به کارت مورد تایید شرکت نیست و در این صورت شرکت هیچ‌گونه
          مسئولیتی بر عهده نخواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد باید هزینه ارائه خدمات از طرف ایمپو را مستقل از هرگونه مشکلی که ممکن است در برنامه ایمپو جهت
          پرداخت آنلاین به وجود آید پرداخت کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          تمام شئونات اخلاقی و پوششی مشاوره حضوری، در ویزیت ویدئویی هم باید رعایت شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پس از گفتگو دو طرفه و اطمینان پزشک / مشاور و کاربر خدمت گیرنده از دریافت پاسخ کامل کاربر، گفتگو پایان خواهد
          یافت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          هرگونه بی احترامی به پزشک/مشاور برابر قانون، پیگرد قانونی خواهد داشت و نیز ارائه خدمات به فرد خاطی متوقف خواهد
          شد. چنان‌چه کاربر خدمت‌گیرنده به فحاشی، توهین و سایر رفتارهای خلاف قانون و اخلاق علیه کاربر خدمت‌دهنده اقدام
          کند، حق مراجعه کاربر خدمت‌دهنده به مراجع ذی‌صلاح محفوظ است. علاوه بر آن به دلیل وارد آمدن لطمه به شهرت و
          اعتبار تجاری، شرکت حق مراجعه به مراجع ذی‌صلاح را خواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> پزشک/مشاور باید مجوز و پروانه طبابت یا مشاوره داشته باشد. </u>
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پزشک/مشاور می بایست تمامی مدارک و مستندات خود را در اسرع وقت به‌صورت پستی - آفلاین، به ایمپو ارسال نماید.
          بدیهی است صحت اطلاعات و مدارک از مراکز ذی صلاح بررسی خواهد شد و پزشک/مشاور پس از تایید می‌تواند به مشاوره دادن
          به کاربر بپردازد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت رعایت همه قوانین و مقررات حوزه سلامت اعم از سیاست‌های ابلاغی، قوانین مصوب مجلس شورای اسلامی،
          آیین‌نامه‌های مصوب هیئت وزیران و سایر مقررات حوزه سلامت، بهداشت و درمان که توسط نهادهای ذی‌ربط به تصویب
          رسیده‌اند، بر عهده کاربر خدمت دهنده است و شرکت در این خصوص مسئولیتی نخواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربران متعهد می‌شوند در صورت مواجهه با نقض هر کدام از تعهدات حین ارائه خدمت یا نقض قوانین موضوعه جمهوری
          اسلامی ایران از جمله قانون مجازات اسلامی (ارتکاب جرم) و قوانین مدنی، بدون مداخله مستقیم، از انجام هر اقدامی بر
          اساس صلاح‌دید شخصی پرهیز کند. کاربر خدمت‌دهنده در صورت نیاز می‌تواند ارائه خدمت خود را به‌طور موقت متوقف و
          موضوع را از طریق شماره 91014180-051 با پشتیبانی شرکت در میان بگذارد، کاربر خدمت‌گیرنده نیز می‌تواند تا برقراری
          تماس با پشتیبانی از کاربر خدمت‌دهنده درخواست توقف خدمت مورد نظر را داشته باشد. در نهایت پشتیبانی شرکت نسبت به
          ادامه یا منتفی شدن خدمت موردنظر، بر مبنای وضعیت موجود تصمیم مقتضی را اخذ می‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در حال حاضر در کلینیک سلامت، خدمات مشاوره آنلاین تحت پوشش بیمه‌های پایه و تکمیلی نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          صدور مرخصی استعلاجی مستلزم حضور فیزیکی پزشک و متقاضی است، بنابراین به دلیل امکان‌پذیر نبودن اعتبارسنجی در بستر
          سکو، صدور مرخصی استعلاجی میسر نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          هر گونه مبلغ پرداختی از سوی بیمار، برای یک درخواست است. در صورتی‌که بیمار به ویزیت با پزشک / مشاور دیگری نیاز
          داشته باشد باید پرداختی برای پزشک/ مشاور دیگر دوباره انجام شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت صحت و سقم اظهارات بیمار به عهده خودش بوده و استفاده از خدمات پزشکی/مشاوره ایمپو به معنی تحصیل برائت از
          تقصیر و برائت از ضمان پزشک/مشاور معالج توسط بیمار است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر باید توجه داشته باشد، هرگونه توصیه و مشاوره ارائه شده توسط پزشک/مشاور، فقط مختص شخصی است که درخواست
          مشاوره داشته و با توجه به تفاوت شرایط هر شخص نسبت به شخص دیگر، کاربر باید از انتقال مشاوره یا توصیه ارائه شده
          به شخص دیگر خودداری نماید.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌تواند در تمامی سرویس‌های کلینیک، با ارسال متن، تصاویر، مدارک پزشکی و صوت (از سمت کاربر خدمات دهنده)
          با پزشک و مشاور گفتگو کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در صورت عدم پاسخگویی پزشک/مشاور در زمان مقرر هر پلن، 100% وجه به اعتبار کاربر افزوده شده یا سوالش به پزشک /
          مشاور دیگر ارجاع داده می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد هزینه ارائه خدمات از طرف شرکت مشخص می‌شود و پس از استفاده از آن نمی‌‌تواند نسبت به هزینه اعلام
          شده اعتراضی داشته باشد. بدیهی است، از آنجایی که کاربر مجاز است هزینه اعلان شده از سوی شرکت را نپذیرد، بنابراین
          در صورت قبول آن، متعهد به پرداخت هزینه می‌باشد. به همین منظور کاربر با قبول این شرایط و قوانین، به شرکت اختیار
          می‌دهد که از محل اعتبار کاربری خود، مبالغ مورد مطالبه را دریافت و وصول کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پرداخت هزینه خدمت ارائه شده و سایر هزینه‌های اعلام شده توسط ایمپو فقط از طریق روش‌هایی که توسط شرکت مشخص
          می‌شود امکان پذیر است. هرگونه روش دیگری نظیر کارت به کارت مورد تایید شرکت نیست و در این صورت شرکت هیچ‌گونه
          مسئولیتی بر عهده نخواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر می‌پذیرد باید هزینه ارائه خدمات از طرف ایمپو را مستقل از هرگونه مشکلی که ممکن است در برنامه ایمپو جهت
          پرداخت آنلاین به وجود آید پرداخت کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          تمام شئونات اخلاقی و پوششی مشاوره حضوری، در ویزیت ویدئویی هم باید رعایت شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پس از گفتگو دو طرفه و اطمینان پزشک / مشاور و کاربر خدمت گیرنده از دریافت پاسخ کامل کاربر، گفتگو پایان خواهد
          یافت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          هرگونه بی احترامی به پزشک/مشاور برابر قانون، پیگرد قانونی خواهد داشت و نیز ارائه خدمات به فرد خاطی متوقف خواهد
          شد. چنان‌چه کاربر خدمت‌گیرنده به فحاشی، توهین و سایر رفتارهای خلاف قانون و اخلاق علیه کاربر خدمت‌دهنده اقدام
          کند، حق مراجعه کاربر خدمت‌دهنده به مراجع ذی‌صلاح محفوظ است. علاوه بر آن به دلیل وارد آمدن لطمه به شهرت و
          اعتبار تجاری، شرکت حق مراجعه به مراجع ذی‌صلاح را خواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> پزشک/مشاور باید مجوز و پروانه طبابت یا مشاوره داشته باشد. </u>
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پزشک/مشاور می بایست تمامی مدارک و مستندات خود را در اسرع وقت به‌صورت پستی - آفلاین، به ایمپو ارسال نماید.
          بدیهی است صحت اطلاعات و مدارک از مراکز ذی صلاح بررسی خواهد شد و پزشک/مشاور پس از تایید می‌تواند به مشاوره دادن
          به کاربر بپردازد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت رعایت همه قوانین و مقررات حوزه سلامت اعم از سیاست‌های ابلاغی، قوانین مصوب مجلس شورای اسلامی،
          آیین‌نامه‌های مصوب هیئت وزیران و سایر مقررات حوزه سلامت، بهداشت و درمان که توسط نهادهای ذی‌ربط به تصویب
          رسیده‌اند، بر عهده کاربر خدمت دهنده است و شرکت در این خصوص مسئولیتی نخواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر خدمت‌دهنده در ارائه توصیه و مشاوره و ارائه هرگونه خدمات دیگری در ایمپو موظف به رعایت کلیه قوانین،
          دستورالعمل‌ها و همچنین عرف و رویه آن حوزه است. همچنین شرایط زمانی (مثلاً توصیه باید در زمان خاصی انجام شود)،
          شرایط عمومی و اختصاصی (شرایط حاکم بر وضعیت جسمانی یا روانی) هر فرد در هر توصیه و مشاوره‌ و سایر خدمات ارائه
          شده، باید مورد توجه قرار گیرد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          اطلاعات کاربری کلیه کاربران نزد کاربر خدمت‌دهنده محرمانه است و کاربر حق ندارد اطلاعات مربوط به حساب طرف مقابل
          را (اعم از مشخصات هویتی، شماره تماس، آدرس، عکس و غیره) ذخیره یا منتشر کند و در دسترس دیگران قرار دهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در ایمپو کاربر خدمت‌دهنده مختار است یک درخواست را بپذیرد یا رد کند. بنابراین، هر درخواستی که از سوی کاربر
          خدمت‌دهنده یا خدمت‌گیرنده قبول و ارائه می‌شود، باید به عنوان یک قرارداد لازم بین آن‌ها و رابطه قراردادی بین
          خود کاربران در نظر گرفته شود. در نتیجه رعایت کامل قوانین و ضوابط در اجرای موضوع هر درخواست، به طور کامل بر
          عهده کاربران است و هیچ مسئولیتی از این بابت به عهده ایمپو نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong>تبصره : </strong>شرکت توسعه فناوری اطلاعات کارآفرین کارکیا شماره ثبت 71838 که نسبت به ارائه خدمات
          اپلیکیشن ایمپو اقدام می‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایمپو صرفاً یک بستر نرم‌افزاری برقرار کننده ارتباط میان کاربر متخصص و کاربر عادی است و هیچ‌گونه مسئولیتی در
          قبال محتوای خدمات انجام شده ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر خدمت‌دهنده حق ارائه خدمات در حوزه غیر تخصصی خود را ندارد و کاربر خدمت‌گیرنده می‌تواند در صورت مواجهه با
          چنین موردی، از طریق ارتباط با پشتیبانی، تخلف را گزارش دهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر خدمت‌دهنده حق ارائه خدمات در حوزه غیر تخصصی خود را ندارد و کاربر خدمت‌گیرنده می‌تواند در صورت مواجهه با
          چنین موردی، از طریق ارتباط با پشتیبانی، تخلف را گزارش دهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مشاوره آنلاین ایمپو علاوه بر سهولت دسترسی تمامی ایرانیان و همچنین کاربرانی که امکان مراجعه حضوری ندارند
          به‌منظور
          <strong>برقراری ارتباط بین بیمار و پزشک/مشاور به جهت دریافت مشاوره یا درمان مقدماتی در سریع‌ترین زمان</strong>
          به‌وجود آمده است؛ لذا تاخیر در ارائه خدمات و به تعویق افتادن زمان مکالمه بیمار، مغایر با هدف و رویکرد ایمپو
          است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پیرو این رویکرد، قوانین زیر در خصوص کلینیک در نظر گرفته شده است:
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پزشک / مشاور ایمپو طی بازه زمانی 2 ساعت پس از پرداخت هزینه توسط کاربر خدمت‌گیرنده، اولین پاسخ را برای کاربر
          خدمت‌گیرنده ارسال می‌کند. (از ساعت 22 الی 8 صبح، زمان استراحت پزشک/ مشاور بوده و جز 2 ساعت زمان مقرر محسوب
          نمی‌شود.)
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در پلن گفتگوی تلفنی، پزشک/مشاور در بازه زمانی 2 ساعت زمان جلسه را تعیین و هماهنگ می‌نماید.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پزشک / مشاور باید در ساعت‌هایی که به‌عنوان فعال - آنلاین در کلینیک سلامت اعلام حضور کرده پاسخگوی کاربران باشد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کلیه پزشکان و مشاورانی که از سرویس کلینیک ایمپو استفاده می‌کنند، موظف به سرویس‌دهی به موقع و استاندارد در زمان
          مقرر به کاربران ایمپو هستند. کاربران در صورت بروز هرگونه مشکل در فرآیندها، با شماره تلفن پشتیبانی ایمپو
          91014180-051 تماس حاصل نمایند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت ارائه خدمات سلامت با کیفیت و مطلوب به عهده کاربر خدمت‌دهنده موردنظر (پزشک، مشاور یا سایر ارائه‌کنندگان
          سلامت) است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          اگر مورد عنوان شده از سوی بیمار در حیطه تخصص پزشک / مشاور نبود، می‌بایست درخواست را لغو و بیمار را به متخصص
          مربوطه ارجاع دهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پزشک در صورت صلاح‌دید دارو تجویز می‌نماید. توضیحات درمان و در صورت لزوم نسخه الکترونیک حداکثر 2 ساعت بعد از
          مکالمه برای کاربر ارسال گردد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت‌های ناشی از توصیه اعم از (تجویز نسخه، مشاوره، پرهیز غذایی، حرکت فیزیکی و...) پزشک/مشاور، به عهده شخص
          اوست و ایمپو در قبال آن هیچ‌گونه مسئولیتی ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          اگر پزشک یا بیمار به‌صورت مستقیم (بدون استفاده از بستر ایمپو ) برای یکدیگر موردی ارسال کنند، خلاف مقررات ایمپو
          بوده و پاسخگوی تبعات احتمالی آن نیست.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          فقط درمان مهم نیست!
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          تجربه بیمار از درمان، علاوه بر تجویز تخصصی و مناسب شامل پارامترهای دیگری از جمله شرح حال‌گیری کامل، رفع نگرانی
          از علائم، احترام به بیمار و پاسخگویی متناسب می‌باشد که روی رضایت یا عدم رضایت بیمار، تاثیرگذار است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          برای بررسی و ارتقاء کیفیت خدمات آنلاین کلینیک سلامت , در پایان هر درخواست ، از مشتری نظرسنجی انجام می‌شود تا
          طبق تجربه خود به پزشک / مشاور و کیفیت خدمات امتیاز بدهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در صورت ناراضی بودن کاربر خدمت گیرنده ، کل وجه پرداختی پس از ثبت درخواست وی و بررسی کارشناسان ایمپو, عودت داده
          می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربران می‌پذیرند ایمپو صرفاً ارائه‌دهنده خدماتی است که ارتباط بین کاربر خدمت‌دهنده با خدمت‌گیرنده را به منظور
          ارائه خدمت مورد نظر فراهم می‌کند، از این رو ایمپو هیچ دخالت و مسئولیتی نسبت به خدمت مورد درخواست کاربران
          ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          خدمات ایمپو ممکن است با مشارکت شرکت‌ها یا طرف تجاری یا هر شخص ثالث دیگری ارائه شود که ایمپو کنترلی روی آن‌ها
          ندارد. در چنین شرایطی کاربر می‌پذیرد که این خدمات، شرایط و قوانین مخصوص خود را دارد و ایمپو مسئولیتی در خصوص
          قوانین و خدمات این شرکت‌ها به عهده ندارد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ارائه شماره تماس یا هرگونه راه ارتباطی غیر از اپلیکیشن (راهنمایی به سرچ نام پزشک/مشاور در گوگل، شماره تلفن،
          آیدی شبکه‌های مجازی، آدرس مطب، بیمارستان یا محل فعالیت و...) و هدایت کاربر جهت پرداخت یا انصراف از مشاوره در
          اپلیکیشن، خلاف قوانین و مقررات بوده و بعد از تذکر در صورت مشاهده موجب قطع همکاری با پزشک/ مشاور می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مشاوره‌ها و گفتگوهای کاربران تنها با حکم مراجع قضایی قابل بازبینی مجدد است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کلیه کسورات قانونی اعم از بیمه، مالیات و سایر به عهده پزشک/مشاور بوده و ایمپو هیچ‌گونه مسئولیتی در قبال آن
          نخواهد داشت.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پزشک/مشاور مکلف است در صورت ممنوعیت دائم یا موقت از اشتغال (به هر نحو که باشد) بلافاصله مراتب را به ایمپو
          اعلام و پروفایل متخصص را غیر فعال نماید.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت همه اقدامات و افعالی که ناشی از عدم رعایت قوانین موضوعه جمهوری اسلامی ایران از جمله قانون مجازات
          اسلامی، ارتکاب جرم در هنگام انجام خدمت و قوانین مدنی باشد، برعهده شخص متخلف بوده و ایمپو هیچ‌گونه مسئولیتی در
          قبال اعمال و افعال فوق نداشته و نخواهد داشت و می‌تواند ضمن غیر فعال کردن متخلف، از طریق مراجع اصلح، اقدامات
          قانونی را علیه نامبرده نسبت به احقاق حقوق قانونی ایمپو به عمل آورد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          مسئولیت قانونی و عواقب کلیه مسائلی که ناشی از قصور پزشکی و کوتاهی و یا نقص دانش خدمت‌دهنده (پزشک/مشاور) به
          وجود آید، متوجه کاربر ارائه‌دهنده خواهد بود .
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پاسخ‌گویی باید در مدت زمان اعلامی به‌صورت جامع و پیوسته انجام شود. پزشک/مشاور در صورت نیاز به مدت ۳ روز پس از
          ویزیت بیمار، برای پاسخگویی به سوالات احتمالی بیمار در دسترس باشد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          شایان ذکر است پزشک/مشاور باید از دریافت هرگونه حق ویزیت اضافه یا خارج از پروسه دریافت نوبت ایمپو خودداری
          نماید.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          در صورتی که کاربر خدمت‌گیرنده از خدمات ارائه شده راضی نباشد، امکان اعلام نارضایتی حداکثر تا 72 ساعت بعد از
          دریافت خدمت از طریق پشتیبانی ایمپو امکان‌پذیر است و هرگونه تصمیم‌گیری در خصوص این موضوع منوط به بررسی کارشناسی
          توسط ایمپو است و نتیجه آن به کاربر اعلام خواهد شد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> نقدها، نظرها، ارتباطات و سایر مطالب</u>
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربری که قصد ارسال نظر در سایت را دارد، الزامی است قوانین زیر را مد نظر داشته باشد:
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          محتوای ارسالی طبق عرف و شئونات جامعه و با بیانی عاری از لحن تند، تمسخر و توهین باشد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          محتوای ارسالی نمی‌تواند شامل اطلاعات شخصی، شماره تماس، راه‌ارتباطی، لینک و… باشد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          درج نظرات گمراه‌کننده که ممکن است نظر افراد را تحت الشعاع قرار دهد و منصفانه نباشد، ممنوع است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          نظرات کاربرانی که دارای نام و نام خانوادگی نامناسب در نام کاربری خود باشند، تایید نخواهد شد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          بدیهی است اگر این قوانین در نظرات کاربری رعایت نشود، نظر وی به نمایش در نخواهد آمد یا پس از انتشار حذف خواهد
          شد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          * ایمپو هیچ‌گونه مسئولیتی در قبال صحت یا عدم صحت نظرات منتشر شده ندارد. نمایش نظرات کاربران به هیچ وجه به معنی
          تایید فنی درباره محتویات نظر نیست و مسئولیت محتوای مندرج بر عهده فرد منتشر کننده آن مطلب است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          با توجه به ساختار بخش نظرات، کاربران از پرسیدن سوال یا درخواست راهنمایی در این بخش خودداری نمایند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          نظرات کاربران باید مبتنی بر واقعیت و صرفا بیانگر تجربه شخصی کاربر باشد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          کاربر ارسال کننده نظر موظف به استفاده از ادبیات محترمانه و عدم توهین به دیگر کاربران است، بدیهی است هرگونه
          توهین به فرد یا افراد، باعث عدم انتشار یا حذف نظر کاربر می‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          قسمت نظرات سایت، با تالارهای گفتگو اشتراک تجربه متفاوت است، لذا برای حفظ ساختار، مباحثی که خارج از چهارچوب این
          قسمت است و حالت بحث و گفتگو دارند، تایید نخواهند شد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          پرهیز از هر گونه توهین ( به ادیان رسمی کشور، آداب، رسوم، قومیت‌ها، لهجه‌ها و گویش‌های مختلف، اشخاص و ...)
          ضروری است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          درج هر نوع آگهی و خبرپراکنی سیاسی، اجتماعی یا مذهبی که جنبه قانونی نداشته باشد، ممنوع است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          هرگونه سوءاستفاده از شماره تلفن همراه یا نشانی پست الکترونیکی دیگران ممنوع و قابل پیگیری قضایی است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u> نحوه ثبت پیشنهادات و شکایات </u>
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایمپو مشتاق و آماده شنیدن پیشنهادات، نظرات، انتقادات و شکایات کاربران است. ارتباط و ثبت پیشنهادات و شکایات از
          طریق ثبت تیکت پشتیبانی در نرم افزار و شماره تماس91014180-051 فراهم است. ایمپو به طور جدی پاسخ‌گوی درخواست‌های
          ثبت شده است.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          همه اطلاعات مورد نیاز کاربر درباره نحوه و شرایط ارائه خدمات ایمپو و استفاده از نرم‌افزار‌های ارائه‌دهنده خدمات
          اعم از خدمت‌گیرنده و خدمت‌دهنده، توسط شرکت در نرم‌افزار قرار داده شده است. شخص می‌تواند با مراجعه به قسمت
          مذکور و مطالعه آن‌ کاملا با شرایط ذکر شده و خدمات ایمپو آشنا شود. همچنین همکاران شرکت در مرکز تماس پاسخگوی
          هرگونه ابهام و سوال کاربر هستند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          چنان‌چه هر یک از کاربران ایمپو در زمان استفاده از خدمات آن با مشکلی مواجه شوند، می‌توانند مشکل را با واحد
          پشتیبانی و امور مشتریان ایمپو با شماره 91014180-051 مطرح کنند. شرکت پیگیری لازم را بنا به مورد انجام خواهد داد
          و تلاش خود را جهت حل موضوع به‌عمل خواهد آورد.
        </CustomTypography>
        <CustomTypography
          tagType="span"
          fontSize="Headline_Small"
          className="mb-4 inline-block"
          color="Neutral_OnBackground"
        >
          مسئولیت ایمپو:
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u>محتوا: </u>
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          یافتن اطلاعات سلامتی و تندرستی آسان است. اما یافتن اطلاعات قابل اعتماد، مرتبط و قابل استفاده می تواند سخت و
          حتی طاقت فرسا باشد. ما می دانیم که اعتماد به دست می آید، و ایجاد محتوای قابل اعتماد هسته اصلی ماموریت ما است.
          ایمپو در راستای این ماموریت در ارائه تمامی سرویس‌‏های خود نهایت تلاش و دقت را دارد و برای تولید محتوا از منابع
          و مراجع اصیل و به‌روز استفاده می‏‌کند.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          تیم ایمپو با بهره‌گیری از راهکارهای امنیتی استاندارد و بین‌المللی در راستای حفظ و تامین امنیت اطلاعات و رعایت
          اصول حریم خصوصی کاربران در کلیه سرویس‌های ارائه شده، از هیچ تلاشی دریغ نخواهد کرد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <u>
            توجه: لازم به ذکر است در صورت احتمال سوء استفاده از سامانه، حق رهگیری و پیگیری قانونی مطابق با قوانین جاری
            جمهوری اسلامی ایران برای ایمپو محفوظ است.
          </u>
        </CustomTypography>

        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          شرکت با تمام امکانات خود تلاش خود را برای جلب رضایت کاربران و رفع هرگونه اختلال احتمالی در زمان استفاده از
          خدمات ایمپو به کار می‌گیرد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایمپو با انجام نظرسنجی از کاربران جهت خدمات ارائه شده، تلاش می‌کند خدماتی با کیفیت مطلوب به آن‌ها ارائه دهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          شرکت با استفاده از نظارت‌های خود و انجام نظرسنجی از کاربر جهت خدمات ارائه شده، تلاش می‌کند خدماتی با کیفیت
          مطلوب به آن‌ها ارائه دهد.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          ایمپو می تواند در صورت صلاحدید نسبت به درج و پخش تبلیغات و آگهی اقدام نماید . این بدان معنی است که شما را به
          سمت محصولات و خدماتی که می تواند مفید باشد، راهنمایی کند . این اقدام با در نظر گرفتن مواردی مانند: هزینه
          ,کیفیت , دسترسی , نظرات مشتریان و تجربه دست اول برای مشتریان جهت ابزارها و خدمات معرفی شده است .
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          اطلاعات کاربر به‌عنوان اطلاعات محرمانه نزد شرکت محافظت شده و دسترسی به آن توسط اشخاص ثالث ممنوع است؛ مگر با
          تصمیم مقام ذی‌صلاح قضایی.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-10  block md:!text-[18px]">
          <strong>تبصره ۱- </strong> حکم این بند شامل دسترسی افرادی که در زنجیره ارائه خدمت به کاربر نهایی حضور دارند،
          نمی‌شود.
        </CustomTypography>
        <CustomTypography tagType="p" className="mb-20  block md:!text-[18px]">
          مسئولیت‌های شرکت مندرج در این متن، فقط در فرضی متصور است که کاربران از طریق اپلیکیشن ایمپو اقدام به اخذ خدمات
          کرده باشد و در غیر این صورت هیچ‌گونه مسئولیتی متوجه شرکت نخواهد بود.
        </CustomTypography>
      </div>
    </HeaderFooterContainer>
  );
};

export default TermsContainer;
