export const MEN_ACHIEVEMENTS_LIST = [
  { title: '20000000 +', subTitle: 'چرخه ثبت شده' },
  { title: '3000000 +', subTitle: 'نصب ایمپو' },
  { title: '1000 +', subTitle: 'مقاله منتشر شده' },
];

export const MEN_COMMENTS_LIST = [
  {
    text: 'خیلی اپ عالیی هستش حس ارامش و اطلاعاتی که راجب چرخه پریودی میده، خیلی قشنگه',
    userName: '@sahar',
    userImage: '/assets/images/comments/1.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'واقعا برنامه ی بی نظیری هست و خیلی منظم و دقیقه ممنونم از طراح این برنامه و همچنین دکترهای عزیز این برنامه به خاطر صبوریشون و همچنین توضیحات کامل تو پاسخگویی به سوالات ما مراجعه کننده ها😍😍😍😍',
    userName: '@zakie saberi',
    userImage: '/assets/images/comments/2.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'ممنونم ازبرنامه خیلی خوبتون همیشه احساس میکنم یکی کنارم هست که هوامو داره توشرایط بحرانی قبل پریود تشکربابت همدلی وراهنماییتون',
    userName: '@najmeh sadeghi',
    userImage: '/assets/images/comments/3.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: 'بنظر من ایمپو بسیار برنامه‌ی کاربردی هستش و خیلی در بهبود روابط موثرومفید هست.من که خیلی راضیم',
    userName: '@zeinab Taksavar',
    userImage: '/assets/images/comments/4.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: ' ‏✓ محاسبه دقیق ‏✓ پیام‌های مرتبط با وضعیت‏✓ گزارش از پریودها‏✓ مقاله‌های به روز‏✓ اشتراک گذاری پریود و حال روز با پارتنر',
    userName: '@mozhgan',
    userImage: '/assets/images/comments/5.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
  {
    text: 'این اپلیکیشن واقعا قلب منو داره، آپدیت جدید خیلی خوب بود خیلی خوشگل شده 😍🥰 علاوه بر اون یه سری جزئیات ریز و جالبی به اپ اضافه شده. در کل این اپ به شما تجربه مراقبت از دخترونگی‌هاتونو با خیال راحت میده ❤️',
    userName: 'مژگان',
    userImage: '/assets/images/comments/6.webp',
    downloadPortIcon: '/assets/icons/instagram.svg',
  },
  {
    text: 'خیلی برنامه خوبیه ❤️بنظر من ارزش داره که آدم مراقب سلامتیش باشه. من که راضیم ❤️',
    userName: 'سحر',
    userImage: '/assets/images/comments/7.webp',
    downloadPortIcon: '/assets/icons/myket1.svg',
  },
  {
    text: 'عالیه 👌 حتی برای پریود نامنظم هم برنامه داره 😍 بنظرم لازمه ایمپو آقایان رو هم پسرا نصب کنن و به همدلشون وصل بشن تا تو روزای پریودی سر به سر پارتنرشون نذارن 😁',
    userName: 'عاطفه',
    userImage: '/assets/images/comments/8.webp',
    downloadPortIcon: '/assets/icons/bazar1.svg',
  },
];

export const MEN_FEATURES_INTRODUCTION_LIST = [
  {
    image: '/assets/images/featuresIntroduction/men/0.webp',
    title: 'همدلی با شریک عاطفی',
    description:
      'با ایمپو، شریک عاطفیت می‌تونه از چرخه قاعدگیت و تغییرات جسمی و روحیت آگاه بشه، تا بهتر همراهت باشه و لحظات رو با درک و همدلی بیشتری سپری کنین.',
  },
  {
    image: '/assets/images/featuresIntroduction/men/1.webp',
    title: 'ثبت نشانه‌های روزانه سلامت و چرخه قاعدگی',
    description:
      'تو ایمپو می‌تونی نشانه‌های روزانه مثل تغییرات خلق‌وخو، علائم جسمی و وضعیت سلامتت رو ثبت کنی، تا الگوهای بدن خودت رو بهتر بشناسی و راحت‌تر مدیریت کنی!',
  },
  {
    image: '/assets/images/featuresIntroduction/men/2.webp',
    title: 'یادآوری و اطلاع‌رسانی تاریخ‌های مهم',
    description:
      'تو ایمپو، همه تاریخ‌های مهم مثل شروع پریود، روز تخمک‌گذاری، دوره باروری و حتی ویزیت‌های پزشکی رو یادت میاریم، تا هیچ چیزی رو از دست ندی و به موقع برنامه‌ریزی کنی!',
  },
  {
    image: '/assets/images/featuresIntroduction/men/3.webp',
    title: 'پیش‌بینی دقیق چرخه قاعدگی و پریود پارتنرت',
    description:
      'تو بخش همدلی ایمپو، چرخه قاعدگی پارتنرت رو به دقت پیش‌بینی می‌کنیم؛ از تاریخ شروع و پایان پریود گرفته تا روزهای خاص چرخه، تا بتونی برنامه‌ریزی بهتری برای خودتون داشته باشی!',
  },
  {
    image: '/assets/images/featuresIntroduction/men/4.webp',
    title: 'کلینیک سلامت و ارتباط با متخصصان',
    description:
      'در کلینیک سلامت ایمپو، می‌تونی با متخصصان در ارتباط باشی، سوالاتت رو بپرسی و توصیه‌های مفید و علمی برای مراقبت از سلامتت دریافت کنی!',
  },
  {
    image: '/assets/images/featuresIntroduction/men/5.webp',
    title: 'خاطره بازی ',
    description:
      'با همدل ایمپو میتونی خاطرات قشنگتون رو توی قسمت خاطره بازی با عکس و متن و تاریخ ثبت کنی. اینجوری یه لیست قشنگ از خاطرات دارین که برای هر دو نفرتون نمایش داده میشه.',
  },
];
