import { PregnancyTestOnlineGoalEnum } from './enums';
import { PregnancyTestOnlineQuestionListTypes, PregnancyTestOnlineResultListTypes } from './types';

export const PREGNANCY_TEST_ONLINE_STEP_QUERY_NAME = 'step';

export const PREGNANCY_TEST_ONLINE_STEP_SESSION_SCORE_NAME = 'testOnlineScore';

export const PREGNANCY_TEST_ONLINE_STEP_SESSION_GOAL_NAME = 'testOnlineGoal';

export const PREGNANCY_TEST_ONLINE_QUESTION_LIST: PregnancyTestOnlineQuestionListTypes = {
  0: {
    step: 0,
    title: ' آیا قصد بارداری داری؟',
    items: [
      {
        title: 'بله، می‌خوام بچه‌دار شم.',
        score: 0,
        message: '',
        goal: PregnancyTestOnlineGoalEnum.Intention,
      },
      {
        title: 'نه، می‌خوام پیشگیری کنم.',
        score: 0,
        message: '',
        goal: PregnancyTestOnlineGoalEnum.Prevention,
      },
    ],
  },
  1: {
    step: 1,
    title: 'از چه روشی برای جلوگیری از بارداری استفاده می‌کنی؟',
    items: [
      {
        title: 'آی یو دی IUD',
        message: 'آی یو دی تا 99 درصد از بارداری جلوگیری می‌کنه؛ بنابراین احتمال بارداریت خیلی کمه',
        score: 1,
      },
      {
        title: ' قرص‌های ضد بارداری ',
        message:
          'هیچ کدوم از روش‌های پیشگیری از بارداری 100 درصد موثر نیستن؛ بنابراین حتی اگه از یکی از روش‌های پیشگیری استفاده می‌کنی، باز هم احتمال بارداری وجود داره. ',
        score: 1,
      },
      {
        title: ' کاندوم  ',
        message: 'استفاده از کاندوم، فقط تا 90 درصد از بارداری جلوگیری می‌کنه.',
        score: 3,
      },
      {
        title: 'سایر روش‌ها',
        message:
          'هیچ کدوم از روش‌های پیشگیری از بارداری 100 درصد موثر نیستن؛ بنابراین حتی اگه از یکی از روش‌های پیشگیری استفاده می‌کنی، باز هم احتمال بارداری وجود داره.',
        score: 5,
      },
      {
        title: 'هیچکدام ',
        message:
          'بیش از یک سوم زوج‌های بدون مشکل ناباروری، در ماه اول اقدام به بارداری، موفق می‌شن. برای اطمینان از بارداری، حتما آزمایش خون بده',
        score: 50,
      },
    ],
  },
  2: {
    step: 2,
    title:
      'آیا بعد از آخرین پریود، رابطه جنسی محافظت نشده داشتین؟ رابطه جنسی محافظت نشده به معنی استفاده نکردن از کاندوم هست',
    items: [
      {
        title: 'بله',
        message: 'در رابطه جنسی بدون استفاده از کاندوم خطر ابتلا به عفونت‌های مقاربتیSTIs وجود داره.',
        score: 1,
      },
      {
        title: 'خیر ',
        message: 'در رابطه جنسی بدون استفاده از کاندوم خطر ابتلا به عفونت‌های مقاربتی(STIs) وجود داره.',
        score: 50,
      },
    ],
  },
  3: {
    step: 3,
    title: 'تاریخ پریود بعدیت رو می‌دونی؟',
    items: [
      {
        title: '2 هفته دیگه یا بیشتر، پریود می‌شم.',
        message: 'بهترین و دقیق‌ترین زمان برای استفاده از بیبی چک یک هفته بعد از تاخیر پریوده',
        score: 1,
      },
      {
        title: 'چند روز دیگه پریود می‌شم.  ',
        message: 'بهترین و دقیق‌ترین زمان برای استفاده از بیبی چک یک هفته بعد از تاخیر پریوده',
        score: 5,
      },
      {
        title: ' پریودم چند روز عقب افتاده.',
        message: 'بهترین و دقیق‌ترین زمان برای استفاده از بیبی چک یک هفته بعد از تاخیر پریوده',
        score: 30,
      },
      {
        title: ' پریودم بیشتر از یک هفته عقب افتاده. ',
        message: 'بهتره برای اطمینان از بارداری از بیبی چک استفاده کنی ',
        score: 20,
      },
    ],
  },
  4: {
    step: 4,
    title: '  آیا لکه‌بینی یا خونریزی خفیف داری؟',
    items: [
      {
        title: '  نه. اصلا لکه‌بینی ندارم ',
        message:
          'خونریزی لانه گزینی یکی از علائم اولیه بارداریه که حدود 7 روز پس از لقاح اسپرم و تخمک ایجاد می‌شه و نهایت تا 48 ساعت ادامه داره. فقط حدود 25 درصد از خانم‌ها این نوع لکه بینی رو تجربه می‌کنن',
        score: 1,
      },
      {
        title: ' برای مدت کوتاهی، مقداری خونریزی خفیف مایل به صورتی رنگ داشتم.',
        message:
          'خونریزی لانه گزینی یکی از علائم اولیه بارداریه که حدود 7 روز پس از لقاح اسپرم و تخمک ایجاد می‌شه و نهایت تا 48 ساعت ادامه داره. فقط حدود 25 درصد از خانم‌ها این نوع لکه بینی رو تجربه می‌کنن.',
        score: 50,
      },
      {
        title: ' خونریزی نسبتا زیادی دارم. ',
        message: 'خونریزی لانه‌گزینی خیلی خفیفه و به رنگ صورتی یا قهوه‌ای تیره مشاهده می‌شه',
        score: 10,
      },
    ],
  },
  5: {
    step: 5,
    title: ' آیا اخیرا متوجه تغییراتی در پستان‌ها شدی؟',
    items: [
      {
        title: 'خیر، همه چیز طبیعی به نظر می‌رسه. ',
        message:
          'حساسیت پستان یکی از شایع‌ترین علائم اولیه بارداریه. در اوایل بارداری ممکنه پستان‌های شما پرتر یا حساس‌تر از حد معمول باشه یا اطراف نوک پستان تیره‌تر بشه.',
        score: 1,
      },
      {
        title: ' کمی حساس شدن. ',
        message:
          'حساسیت پستان یکی از شایع‌ترین علائم اولیه بارداریه. در اوایل بارداری ممکنه پستان‌های شما پرتر یا حساس‌تر از حد معمول باشه یا اطراف نوک پستان تیره‌تر بشه.',
        score: 10,
      },
      {
        title: ' احساس درد می‌کنم. ',
        message:
          'حساسیت پستان یکی از شایع‌ترین علائم اولیه بارداریه. در اوایل بارداری ممکنه پستان‌های شما پرتر یا حساس‌تر از حد معمول باشه یا اطراف نوک پستان تیره‌تر بشه.',
        score: 20,
      },
      {
        title: 'نوک پستان‌هام کمی تیره‌تر از حد معمول به نظر می‌رسه',
        message:
          'حساسیت پستان یکی از شایع‌ترین علائم اولیه بارداریه. در اوایل بارداری ممکنه پستان‌های شما پرتر یا حساس‌تر از حد معمول باشه یا اطراف نوک پستان تیره‌تر بشه.',
        score: 25,
      },
    ],
  },
  6: {
    step: 6,
    title: 'آیا اخیرا احساس حالت تهوع داری؟',
    items: [
      {
        title: 'خیر',
        message:
          'از هفته دوم تا هشتم بارداری ممکنه احساس تهوع داشته باشی و حتی استفراغ کنی. این حالت معمولاً در هفته شانزدهم از بین میره.',
        score: 1,
      },
      {
        title: ' گاهی اوقات ',
        message:
          'از هفته دوم تا هشتم بارداری ممکنه احساس تهوع داشته باشی و حتی استفراغ کنی. این حالت معمولاً در هفته شانزدهم از بین میره.',
        score: 10,
      },
      {
        title: ' گاهی اوقات وقتی گرسنه‌ام احساس حالت تهوع دارم. ',
        message:
          'از هفته دوم تا هشتم بارداری ممکنه احساس تهوع داشته باشی و حتی استفراغ کنی. این حالت معمولاً در هفته شانزدهم از بین میره.',
        score: 15,
      },
      {
        title: 'حالت تهوع زیادی دارم!',
        message:
          'از هفته دوم تا هشتم بارداری ممکنه احساس تهوع داشته باشی و حتی استفراغ کنی. این حالت معمولاً در هفته شانزدهم از بین میره.',
        score: 20,
      },
    ],
  },
  7: {
    step: 7,
    title: 'این روزها سطح انرژیت چه تغییری کرده؟',
    items: [
      {
        title: 'تغییری نکرده و مثل همیشه هستم',
        message: 'در چند هفته اول بارداری احساس خستگی غیرعادی می‌کنی. این حس می‌تونه به دلیل افزایش سطح پروژسترون باشه',
        score: 1,
      },
      {
        title: ' کمی خواب‌آلود هستم. ',
        message: 'در چند هفته اول بارداری احساس خستگی غیرعادی می‌کنی. این حس می‌تونه به دلیل افزایش سطح پروژسترون باشه',
        score: 15,
      },
      {
        title: ' بیشتر بعدازظهرها واقعاً احساس خستگی می‌کنم. ',
        message: 'در چند هفته اول بارداری احساس خستگی غیرعادی می‌کنی. این حس می‌تونه به دلیل افزایش سطح پروژسترون باشه',
        score: 20,
      },
      {
        title: 'من همیشه خسته‌ام',
        message: 'در چند هفته اول بارداری احساس خستگی غیرعادی می‌کنی. این حس می‌تونه به دلیل افزایش سطح پروژسترون باشه',
        score: 10,
      },
    ],
  },
  8: {
    step: 8,
    title: 'آیا این روزها بیشتر از حد معمول دفع ادرار داری؟',
    items: [
      {
        title: 'متوجه تغییر خاصی نشدم.',
        message:
          'تکرر ادرار یکی از علائم اولیه بارداریه؛ اما می‌تونه به دلایل دیگری مثل عفونت ادراری هم پیش بیاد. اگه دچار تکرر ادرار شدی، حتما به پزشک مراجعه کن.',
        score: 1,
      },
      {
        title: 'بله، کمی بیشتر از حد معمول',
        message:
          'تکرر ادرار یکی از علائم اولیه بارداریه؛ اما می‌تونه به دلایل دیگری مثل عفونت ادراری هم پیش بیاد. اگه دچار تکرر ادرار شدی، حتما به پزشک مراجعه کن.',
        score: 10,
      },
      {
        title: 'در طول روز و شب باید پشت سر هم دستشویی برم',
        message:
          'تکرر ادرار یکی از علائم اولیه بارداریه؛ اما می‌تونه به دلایل دیگری مثل عفونت ادراری هم پیش بیاد. اگه دچار تکرر ادرار شدی، حتما به پزشک مراجعه کن',
        score: 25,
      },
      {
        title: 'مثانه‌ام همیشه پُره',
        message:
          'تکرر ادرار یکی از علائم اولیه بارداریه؛ اما می‌تونه به دلایل دیگری مثل عفونت ادراری هم پیش بیاد. اگه دچار تکرر ادرار شدی، حتما به پزشک مراجعه کن.',
        score: 15,
      },
    ],
  },
  9: {
    step: 9,
    title: 'حال روحیت اخیرا چه تغییری کرده؟',
    items: [
      {
        title: 'مثل همیشه هستم و تغییری خاصی احساس نمی‌کنم',
        message:
          'تغییر هورمون‌ها می‌تونه باعث تغییرات خلقی در مراحل اولیه بارداری بشه. حتی  ممکنه بدون دلیل گریه کنی. البته نوسانات خلقی می‌تونه به دلیل PMS هم باشه؛ بنابراین برای اطمینان حتما تست بارداری انجام بده',
        score: 1,
      },
      {
        title: 'کمی بداخلاق بودم؛ اما تغییر قابل توجهی احساس نمی‌کنم.',
        message:
          'تغییر هورمون‌ها می‌تونه باعث تغییرات خلقی در مراحل اولیه بارداری بشه. حتی  ممکنه بدون دلیل گریه کنی. البته نوسانات خلقی می‌تونه به دلیل PMS هم باشه؛ بنابراین برای اطمینان حتما تست بارداری انجام بده',
        score: 10,
      },
      {
        title: 'این روزها با همه‌کس و همه چیز بداخلاقم.',
        message:
          'تغییر هورمون‌ها می‌تونه باعث تغییرات خلقی در مراحل اولیه بارداری بشه. حتی  ممکنه بدون دلیل گریه کنی. البته نوسانات خلقی می‌تونه به دلیل PMS هم باشه؛ بنابراین برای اطمینان حتما تست بارداری انجام بده',
        score: 15,
      },
      {
        title: 'نوسانات احساسی شدیدی تجربه می‌کنم ',
        message:
          'تغییر هورمون‌ها می‌تونه باعث تغییرات خلقی در مراحل اولیه بارداری بشه. حتی  ممکنه بدون دلیل گریه کنی. البته نوسانات خلقی می‌تونه به دلیل PMS هم باشه؛ بنابراین برای اطمینان حتما تست بارداری انجام بده',
        score: 20,
      },
    ],
  },
  10: {
    step: 10,
    title: 'آیا اخیرا اشتهات تغییر کرده؟',
    items: [
      {
        title: 'خیر، همه چیز عادی و مثل قبل هست',
        message:
          'در دوران بارداری ممکنه اشتها و میلت به بعضی چیزها مثل چای، قهوه یا غذاهای چرب کم بشه یا چیزهایی که قبلا دوست نداشتی، هوس کنی. حتی ممکنه با بوییدن بعضی چیزها مثل قهوه، گوشت یا الکل احساس بدی داشته باشی.',
        score: 1,
      },
      {
        title:
          'من نسبت به خوردن یا نوشیدن برخی چیزهایی که قبلاً از آنها لذت می‌بردم (مانند چای، قهوه، طعم‌های تند) حس بدی دارم.',
        message:
          'در دوران بارداری ممکنه اشتها و میلت به بعضی چیزها مثل چای، قهوه یا غذاهای چرب کم بشه یا چیزهایی که قبلا دوست نداشتی، هوس کنی. حتی ممکنه با بوییدن بعضی چیزها مثل قهوه، گوشت یا الکل احساس بدی داشته باشی.',
        score: 15,
      },
      {
        title: 'این روزا اشتهام خیلی زیاد شده.',
        message:
          'در دوران بارداری ممکنه اشتها و میلت به بعضی چیزها مثل چای، قهوه یا غذاهای چرب کم بشه یا چیزهایی که قبلا دوست نداشتی، هوس کنی. حتی ممکنه با بوییدن بعضی چیزها مثل قهوه، گوشت یا الکل احساس بدی داشته باشی.',
        score: 10,
      },
      {
        title: 'بوی بعضی از غذاها اذیتم می‌کنه. ',
        message:
          'در دوران بارداری ممکنه اشتها و میلت به بعضی چیزها مثل چای، قهوه یا غذاهای چرب کم بشه یا چیزهایی که قبلا دوست نداشتی، هوس کنی. حتی ممکنه با بوییدن بعضی چیزها مثل قهوه، گوشت یا الکل احساس بدی داشته باشی.',
        score: 20,
      },
    ],
  },
  11: {
    step: 11,
    title: 'آیا بیشتر از همیشه احساس نفخ می‌کنی؟',
    items: [
      {
        title: 'بله، من بیش از حد معمول احساس نفخ دارم.',
        message:
          'در ماه اول بارداری، برخی افراد دچار نفخ می‌شن که به دلیل افزایش هورمون پروژسترون هست که هضم غذا رو کندتر می‌کنه.',
        score: 20,
      },
      {
        title: 'نه - هیچ تغییری نکردم',
        message:
          'در ماه اول بارداری، برخی افراد دچار نفخ می‌شن که به دلیل افزایش هورمون پروژسترون هست که هضم غذا رو کندتر می‌کنه.',
        score: 1,
      },
      {
        title: 'نمی‌دونم.',
        message:
          'در ماه اول بارداری، برخی افراد دچار نفخ می‌شن که به دلیل افزایش هورمون پروژسترون هست که هضم غذا رو کندتر می‌کنه.',
        score: 10,
      },
    ],
  },
};

export const PREGNANCY_TEST_ONLINE_RESULTS_LIST: PregnancyTestOnlineResultListTypes = {
  result1: {
    Intention: {
      title: 'بر اساس جواب‌های که دادی، احتمال بارداریت تقریبا زیاده',
      message:
        'اگر تصمیم به بارداری گرفتی باید بتونی هفته به هفته بارداریت رو زیر نظر داشته باشی و از تغییرات بدنت و رشد جنین مطلع بشی. اپلیکیشن ایمپو در هفته به هفته بارداری کنارته و تغییرات و مراقبت‌های هر هفته رو بهت یادآوری می‌کنه.',
    },

    Prevention: {
      title: 'بر اساس جواب‌های که دادی، احتمال بارداریت تقریبا زیاده',
      message:
        'برای اطمینان حتما بعد از 7 روز تاخیر در پریود، از بیبی‌چک استفاده کن. برخی از این علائم ممکنه به دلایلی غیر از بارداری باشه. اگه قصد پیشگیری از بارداری داری، حتما از روش‌های موثر جلوگیری استفاده کن. برای اینکه از حاملگی ناخواسته جلوگیری کنی، باید از روزهای باروری و تخمک‌گذاریت باخبر بشی. اپلیکیشن ایمپو با تکیه بر چرخه قاعدگی، روزهای باروری که احتمال بارداری بالایی دارن رو بهت یادآوری می‌کنه تا بتونی رابطه جنسیت رو با این روزها هماهنگ کنی.',
    },
  },

  result2: {
    Intention: {
      title: 'بر اساس جواب‌هایی که انتخاب کردی، احتمال بارداری وجود داره',
      message:
        'با این حال برخی از علائمت ممکنه به دلایلی غیر از بارداری باشه. همچنین، همه خانم‌ها علائم اولیه بارداری یکسانی تجربه نمی‌کنن. برای اطمینان حتما پس از 7 روز تاخیر در پریود، از تست بیبی چک استفاده کن. اگه هدفت اقدام به بارداریه، ایمپو روزهای باروری و تخمک‌گذاری رو تعیین می‌کنه، همچنین روزهای مناسب رابطه جنسی رو بهت یادآوری و شانس بارداری در اون روزها رو هم محاسبه می‌کنه.',
    },

    Prevention: {
      title: 'ر اساس جواب‌هایی که انتخاب کردی احتمال بارداریت متوسطه اما هنوز هم امکان بارداری وجود داره.',
      message:
        'اگه هدفت پیشگیری از بارداریه، باید از روزهای باروری و تخمک‌گذاریت با خبر باشی تا رابطه جنسیت رو با این روزها هماهنگ کنی. اپلیکیشن ایمپو با ثبت دقیق چرخه قاعدگیت، روزهای باروری و تخمک‌گذاری رو بهت یادآوری کرده و کمک می‌کنه به هدفت برسی.',
    },
  },

  result3: {
    Intention: {
      title: 'بر اساس جواب‌هایی که دادی، احتمال بارداریت کمه ',
      message:
        'اگر هدفت اقدام به بارداری هست، باید از روزهای باروری و تخمک‌گذاریت باخبر بشی تا در روزهایی که احتمال بارداری بالایی داری، رابطه جنسی داشته باشی. اپلیکیشن ایمپو با توجه به چرخه قاعدگیت روزهایی که احتمال بارداری بالایی داری رو بهت پیشنهاد میده. همچنین در قسمت کیت تخمک‌گذاری ایمپو می‌تونی با استفاده از کیت و تفسیر اون، از روز دقیق تخمک‌گذاریت باخبر بشی.',
    },

    Prevention: {
      title: 'بر اساس جواب‌هایی که دادی، احتمال بارداریت کم و ضعیفه ',
      message:
        'اگه به‌طور مداوم از روش‌های پیشگیری از بارداری استفاده می‌کنی و در دوران باروری، رابطه جنسی محافظت شده داری، احتمال بارداریت خیلی کمه؛ اما غیرممکن نیست. همه خانم‌ها علائم اولیه بارداری رو تجربه نمی‌کنن و تجربه‌های متفاوتی دارن. برای اطمینان پس از 7 روز تاخیر در پریود از بیبی چک استفاده کن. یکی از امکانات اپلیکیشن ایمپو اعلام بهترین زمان استفاده از بیبی‌چک و تفسیرش هست.',
    },
  },
};
